bdbm_drv_new_version/run/fio/log/old_version/n/3_fio_n2048.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=7181: Tue Mar  7 17:42:52 2017
  write: IOPS=34.1k, BW=137MiB/s (143MB/s)(1000MiB/7321msec)
    slat (usec): min=6, max=15612, avg=26.27, stdev=84.43
    clat (usec): min=1, max=19904, avg=3447.83, stdev=1197.35
     lat (usec): min=13, max=19927, avg=3474.10, stdev=1203.34
    clat percentiles (usec):
     |  1.00th=[ 1192],  5.00th=[ 1768], 10.00th=[ 2160], 20.00th=[ 2384],
     | 30.00th=[ 2768], 40.00th=[ 3440], 50.00th=[ 3600], 60.00th=[ 3792],
     | 70.00th=[ 3920], 80.00th=[ 3984], 90.00th=[ 4448], 95.00th=[ 5152],
     | 99.00th=[ 7392], 99.50th=[ 7776], 99.90th=[11712], 99.95th=[15168],
     | 99.99th=[19840]
    lat (usec) : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=7.81%, 4=74.88%, 10=17.08%, 20=0.20%
  cpu          : usr=2.51%, sys=42.90%, ctx=288862, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=137MiB/s (143MB/s), 137MiB/s-137MiB/s (143MB/s-143MB/s), io=1000MiB (1049MB), run=7321-7321msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%